app/controllers/items_controller.rb

  def index
    @items = Item.all.order(created_at: :desc)
---
SELECT `items`.* FROM `items` ORDER BY `items`.`created_at` DESC